app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "posts".* FROM "posts" ORDER BY updated_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
  def index
    @post = Post.find_by(params[:user_id])
    @posts = Post.all
    @posts = @posts.reorder("updated_at DESC").paginate(:page => params[:page], :per_page => 5)

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "jhbjhvhjvbhjvhjv"], ["content", "khjkjhbjhjhb"], ["created_at", 2017-05-05 01:27:29 UTC], ["updated_at", 2017-05-05 01:27:29 UTC], ["user_id", 1]]
---
  def create
    puts "create"
    puts @post
    post = Post.create(post_params)