app/controllers/user_controller_controller.rb

  def show
    @user = User.find(params[:id])
    @posts = @user.posts
    @posts = @posts.reorder("updated_at DESC").paginate(:page => params[:page], :per_page => 5)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY updated_at DESC LIMIT $2 OFFSET $3  [["user_id", 10], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 11]]